cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'jeffkowalski/geeknote', 'git://github.com/jeffkowalski/geeknote'

# project requirements
brew 'coreutils' # gseq, gtimeout
brew 'rbenv'

# Dependecies for packages below
cask 'osxfuse'  # sshfs

# Things I use
brew 'terminal-notifier'
brew 'stow'
brew 'rclone'
brew 'git-delta'
brew 'less'
brew 'bat'
brew 'sheldon'
brew 'fzf'
brew 'ripgrep'
brew 'overmind'
brew 'tmux'
brew 'emacs'  # command line, macOS app is below
brew 'mtr'
brew 'keychain'
brew 'pinentry-mac'
brew 'the_silver_searcher'
brew 'watch'
brew 'ssh-copy-id'
brew 'pstree'
brew 'tree'
brew 'wget'
brew 'aide'
brew 'pv'
brew 'parallel'
brew 'nmap'
brew 'md5deep'
brew 'imagemagick'
brew 'hub'
brew 'gnupg2'
brew 'geeknote', args: ['HEAD']
brew 'diff-so-fancy'
brew 'tor'
brew 'sshfs'
cask 'bartender'
cask 'caffeine'
cask 'emacs'  # macOS app, command line is above
cask 'steam'
cask 'battle-net'
cask 'rescuetime'
cask 'growlnotify'
cask 'vlc'
cask 'flowdock'
cask 'skitch'
cask 'spotify'
cask 'airfoil'
cask 'google-chrome'
cask 'firefox'
cask 'arq'
cask 'iterm2'
cask 'dropbox'
cask 'launchbar'
cask 'istat-menus'
cask 'divvy'
cask 'evernote'
cask 'atom'
cask 'transmission'
cask 'cyberduck'
cask 'disk-inventory-x'
cask 'google-backup-and-sync'
cask 'grandperspective'
cask 'microsoft-office'
cask 'sequel-pro'
cask 'whatsapp'
cask 'soulver'
cask 'tunnelblick'
cask 'sqlpro-for-postgres'
cask 'anki'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'zoomus'
cask 'plex-media-server'
cask 'ngrok'
cask 'teamviewer'
cask 'ivpn'
cask 'adobe-acrobat-reader'
mas '1Password', id: 443987910
mas 'Growl', id: 467939042
mas 'IA Writer', id: 775737590
mas 'Movist', id: 461788075
mas 'Kindle', id: 405399194





# tap 'caskroom/cask'
# tap 'caskroom/versions'
# tap 'homebrew/boneyard'
# tap 'homebrew/bundle'
# tap 'homebrew/core'
# tap 'homebrew/dupes'
# tap 'homebrew/nginx'
# tap 'homebrew/php'
# tap 'homebrew/services'
# tap 'homebrew/versions'
# cask 'java'
# brew 'advancecomp'
# brew 'libgpg-error'
# brew 'libgcrypt'
# brew 'pcre'
# brew 'aide'
# brew 'gettext'
# brew 'libffi'
# brew 'glib'
# brew 'libpng'
# brew 'freetype'
# brew 'fontconfig'
# brew 'pixman'
# brew 'cairo'
# brew 'git'
# brew 'pkg-config'
# brew 'gobject-introspection'
# brew 'atk'
# brew 'autoconf'
# brew 'automake'
# brew 'awscli'
# brew 'berkeley-db'
# brew 'brotli'
# brew 'coreutils'
# brew 'zeromq'
# brew 'czmq'
# brew 'diff-so-fancy'
# brew 'libassuan'
# brew 'libksba'
# brew 'pth'
# brew 'dirmngr'
# brew 'openssl'
# brew 'jpeg'
# brew 'libtiff'
# brew 'wxmac'
# brew 'erlang'
# brew 'elixir'
# brew 'emacs'
# brew 'libtool'
# brew 'icu4c'
# brew 'harfbuzz'
# brew 'pango'
# brew 'fontforge'
# brew 'fonttools', args: ['with-pygtk']
# brew 'gdbm'
# brew 'gdk-pixbuf'
# brew 'readline'
# brew 'sqlite'
# brew 'python'
# brew 'geeknote', args: ['HEAD']
# brew 'little-cms2'
# brew 'ghostscript'
# brew 'gifsicle'
# brew 'git-extras'
# brew 'gnu-tar'
# brew 'gnu-time'
# brew 'gnupg'
# brew 'pinentry'
# brew 'gpg-agent'
# brew 'libusb'
# brew 'libusb-compat'
# brew 'gnupg2'
# brew 'go'
# brew 'gsettings-desktop-schemas'
# brew 'hicolor-icon-theme'
# brew 'libepoxy'
# brew 'gtk+3'
# brew 'libgsf'
# brew 'libcroco'
# brew 'librsvg'
# brew 'goffice'
# brew 'gtk+'
# brew 'hadoop'
# brew 'heroku'
# brew 'hive'
# brew 'htop-osx'
# brew 'hub'
# brew 'xz'
# brew 'imagemagick'
# brew 'ispell'
# brew 'jenv'
# brew 'jhead'
# brew 'jpegoptim'
# brew 'kestrel'
# brew 'keychain'
# brew 'lame'
# brew 'libevent'
# brew 'libmagic'
# brew 'libmaxminddb'
# brew 'libnet'
# brew 'libsodium'
# brew 'libtasn1'
# brew 'libxml2'
# brew 'makedepend'
# brew 'makensis'
# brew 'mas'
# brew 'maven'
# brew 'mhash'
# brew 'mcrypt'
# brew 'md5deep'
# brew 'memcached', restart_service: true
# brew 'mongodb'
# brew 'mono'
# brew 'mp3check'
# brew 'mp3val'
# brew 'mtr'
# brew 'mysql', restart_service: true
# brew 'nmap'
# brew 'node'
# brew 'optipng'
# brew 'ossp-uuid'
# brew 'parallel'
# brew 'pngcrush'
# brew 'pngquant'
# brew 'polipo'
# brew 'popt'
# brew 'python3'
# brew 'postgresql', restart_service: true
# brew 'proxychains-ng'
# brew 'pstree'
# brew 'pv'
# brew 'py2cairo'
# brew 'pygobject'
# brew 'pygtk'
# brew 'qpdf'
# brew 'qt@5.5'
# brew 'ruby-build'
# brew 'rbenv'
# brew 'redis', restart_service: true
# brew 'rpm'
# brew 's3cmd'
# brew 's3sync'
# brew 'sbt'
# brew 'scala'
# brew 'socat'
# brew 'squid'
# brew 'ssh-copy-id'
# brew 'tcptraceroute'
# brew 'the_silver_searcher'
# brew 'tidy-html5'
# brew 'tree'
# brew 'unixodbc'
# brew 'watch'
# brew 'wget'
# brew 'wrk'
# brew 'homebrew/boneyard/ngrok'
# brew 'homebrew/boneyard/phpenv'
# brew 'homebrew/dupes/apple-gcc42'
# brew 'homebrew/nginx/nginx-full', args: ['with-sub']
# brew 'homebrew/php/php70', args: ['with-thread-safety']
# brew 'homebrew/php/composer'
# brew 'homebrew/php/php-build'
# brew 'homebrew/php/php-cs-fixer'
# brew 'homebrew/php/php53'
# brew 'homebrew/php/php70-pthreads'
# brew 'homebrew/versions/mongodb30'
# brew 'homebrew/versions/phantomjs192'
# cask 'growlnotify'
# cask 'vagrant'
# cask 'virtualbox'
# mas 'Xcode', id: 497799835
# mas 'Kindle', id: 405399194
# mas 'Growl', id: 467939042
# mas 'iMovie', id: 408981434
# mas 'iPhoto', id: 408981381
# mas 'Keynote', id: 409183694
# mas '1Password', id: 443987910
# mas 'Pages', id: 409201541
# mas 'iMovie 9.0.9', id: 408981434
# mas 'GarageBand', id: 408980954
# mas 'Message+', id: 885557198
# mas 'Numbers', id: 409203825
# mas 'Harvest', id: 506189836
